---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalNode
source: html/17b6fe15-2ebd-9f43-bc97-7b5948f9f4a3.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.GetAnalyticalNode Method

Gets the analytical node at the current iteration step.

## Syntax (C#)
```csharp
public MEPAnalyticalNode GetAnalyticalNode()
```

## Returns
The retrieved node.